apache/nuttx/arch/arm/src/common/stm32/stm32_serial_m0_v3.c
  .irq           = STM32_IRQ_USART3,
  .parity        = CONFIG_USART3_PARITY,
  .bits          = CONFIG_USART3_BITS,
  .stopbits2     = CONFIG_USART3_2STOP,
  .baud          = CONFIG_USART3_BAUD,
  .apbclock      = STM32_PCLK1_FREQUENCY,
  .usartbase     = STM32_USART3_BASE,
  .tx_gpio       = GPIO_USART3_TX,
  .rx_gpio       = GPIO_USART3_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_USART3_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_USART3_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_USART3_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_USART3_RTS,
#  endif
#  ifdef CONFIG_USART3_RXDMA
  .rxdma_channel = DMAMAP_USART3_RX,
  .rxfifo        = g_usart3rxfifo,
#  endif

#  ifdef CONFIG_USART3_RS485
  .rs485_dir_gpio = GPIO_USART3_RS485_DIR,
#    if (CONFIG_USART3_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
  .lock = SP_UNLOCKED,
};
#endif

/* This describes the state of the STM32 USART4 port. */

#ifdef CONFIG_STM32_USART4
static struct stm32_serial_s g_usart4priv =
{
  .dev =
    {
#  if CONSOLE_USART == 4
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_USART4_RXBUFSIZE,
        .buffer  = g_usart4rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_USART4_TXBUFSIZE,
        .buffer  = g_usart4txbuffer,
      },
#  ifdef CONFIG_USART4_RXDMA
      .ops       = &g_uart_dma_ops,
#  else
      .ops       = &g_uart_ops,
#  endif
      .priv      = &g_usart4priv,
    },

  .irq           = STM32_IRQ_USART4,
  .parity        = CONFIG_USART4_PARITY,
  .bits          = CONFIG_USART4_BITS,
  .stopbits2     = CONFIG_USART4_2STOP,
#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  .iflow         = false,
#  endif
#  ifdef CONFIG_SERIAL_OFLOWCONTROL
  .oflow         = false,
#  endif
  .baud          = CONFIG_USART4_BAUD,
  .apbclock      = STM32_PCLK1_FREQUENCY,
  .usartbase     = STM32_USART4_BASE,
  .tx_gpio       = GPIO_USART4_TX,
  .rx_gpio       = GPIO_USART4_RX,
#  ifdef CONFIG_SERIAL_OFLOWCONTROL
  .cts_gpio      = 0,
#  endif
#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rts_gpio      = 0,
#  endif
#  ifdef CONFIG_USART4_RXDMA
  .rxdma_channel = DMAMAP_USART4_RX,
  .rxfifo        = g_usart4rxfifo,
#  endif

#  ifdef CONFIG_USART4_RS485
  .rs485_dir_gpio = GPIO_USART4_RS485_DIR,
#    if (CONFIG_USART4_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
  .lock = SP_UNLOCKED,
};
#endif

/* This describes the state of the STM32 USART5 port. */

#ifdef CONFIG_STM32_USART5
static struct stm32_serial_s g_usart5priv =
{
  .dev =
    {
#  if CONSOLE_USART == 5
      .isconsole = true,
#  endif
      .recv     =
      {
        .size   = CONFIG_USART5_RXBUFSIZE,
        .buffer = g_usart5rxbuffer,
      },
      .xmit     =
      {
        .size   = CONFIG_USART5_TXBUFSIZE,
        .buffer = g_usart5txbuffer,
      },
#  ifdef CONFIG_USART5_RXDMA
      .ops      = &g_uart_dma_ops,
#  else
      .ops      = &g_uart_ops,
#  endif
      .priv     = &g_usart5priv,
    },

  .irq            = STM32_IRQ_USART5,
  .parity         = CONFIG_USART5_PARITY,
  .bits           = CONFIG_USART5_BITS,
  .stopbits2      = CONFIG_USART5_2STOP,
#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  .iflow         = false,
#  endif
#  ifdef CONFIG_SERIAL_OFLOWCONTROL
  .oflow         = false,
#  endif
  .baud           = CONFIG_USART5_BAUD,
  .apbclock       = STM32_PCLK1_FREQUENCY,
  .usartbase      = STM32_USART5_BASE,
  .tx_gpio        = GPIO_USART5_TX,
  .rx_gpio        = GPIO_USART5_RX,
#  ifdef CONFIG_SERIAL_OFLOWCONTROL
  .cts_gpio      = 0,
#  endif
#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rts_gpio      = 0,
#  endif
#  ifdef CONFIG_USART5_RXDMA
  .rxdma_channel = DMAMAP_USART5_RX,
  .rxfifo        = g_usart5rxfifo,
#  endif

#  ifdef CONFIG_USART5_RS485
  .rs485_dir_gpio = GPIO_USART5_RS485_DIR,
#    if (CONFIG_USART5_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
  .lock = SP_UNLOCKED,
};
#endif

/* This table lets us iterate over the configured USARTs */

static struct stm32_serial_s * const g_uart_devs[STM32_NUSART] =
{
#ifdef CONFIG_STM32_USART1
  [0] = &g_usart1priv,
#endif
#ifdef CONFIG_STM32_USART2
  [1] = &g_usart2priv,
#endif
#ifdef CONFIG_STM32_USART3
  [2] = &g_usart3priv,
#endif
#ifdef CONFIG_STM32_USART4
  [3] = &g_usart4priv,
#endif
#ifdef CONFIG_STM32_USART5
  [4] = &g_usart5priv,
#endif
};

#ifdef CONFIG_PM
static  struct pm_callback_s g_serialcb =
{
  .notify  = stm32serial_pmnotify,
  .prepare = stm32serial_pmprepare,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32serial_getreg
 ****************************************************************************/

static inline uint32_t stm32serial_getreg(struct stm32_serial_s *priv,
                                          int offset)
{
  return getreg32(priv->usartbase + offset);
}

/****************************************************************************
 * Name: stm32serial_putreg
 ****************************************************************************/

static inline void stm32serial_putreg(struct stm32_serial_s *priv,
                                      int offset, uint32_t value)
{
  putreg32(value, priv->usartbase + offset);
}

/****************************************************************************
 * Name: stm32serial_setusartint
 ****************************************************************************/

static void stm32serial_setusartint(struct stm32_serial_s *priv,
                                    uint16_t ie)
{
  uint32_t cr;

  /* Save the interrupt mask */

  priv->ie = ie;

  /* And restore the interrupt state
   * (see the interrupt enable/usage table above)
   */

  cr = stm32serial_getreg(priv, STM32_USART_CR1_OFFSET);
  cr &= ~(USART_CR1_USED_INTS);
  cr |= (ie & (USART_CR1_USED_INTS));
  stm32serial_putreg(priv, STM32_USART_CR1_OFFSET, cr);

  cr = stm32serial_getreg(priv, STM32_USART_CR3_OFFSET);
  cr &= ~USART_CR3_EIE;
  cr |= (ie & USART_CR3_EIE);
  stm32serial_putreg(priv, STM32_USART_CR3_OFFSET, cr);
}

/****************************************************************************
 * Name: stm32serial_restoreusartint
 ****************************************************************************/

static void stm32serial_restoreusartint(struct stm32_serial_s *priv,
                                        uint16_t ie)
{
  irqstate_t flags;

  flags = enter_critical_section();

